Repository: bernard-geraud/coding-with-kids
Catalog: locale/*/LC_MESSAGES/index.po
Languages: fr

source: Guideliness
fr: Directives

source: about
fr: à propos de

source: Welcome to Coding with Kids!
fr: Bienvenue sur Coding with Kids !

source: Coding with kids can be a *great* way to not only teach them some skills that will help them with their own lives, but also *create or strengthen* some lasting **bonds between you and them.**
fr: Coder avec les enfants peut être un *moyen formidable* non seulement de leur enseigner des compétences qui les aideront dans leur propre vie, mais aussi de *créer ou de renforcer* des **liens durables entre vous et eux**.

source: Here is a new content from VS Code.
fr: Voici un nouveau contenu de VS Code.

source: Throughout your journey you will both likely learn new ``concepts`` and ``terms`` that will expand your horizons and provide hours of enjoyment.
fr: Tout au long de votre voyage, vous apprendrez probablement de nouveaux ``concepts`` et ``termes`` qui élargiront vos horizons et vous procureront des heures de plaisir.

source: Some kids have problems with screen time and if you leave them unattended with a screen and they have access to things like YouTube or games, they may not stay focused on the task at hand.
fr: Certains enfants ont des problèmes avec le temps passé devant un écran et si vous les laissez sans surveillance devant un écran et qu'ils ont accès à des choses comme YouTube ou des jeux, ils risquent de ne pas rester concentrés sur la tâche à accomplir.

source: another item
fr: élément de la liste

source: There are a lots of great options for where to start, and :doc:`/Options/justlogic` is a great place to start. Note that the :doc:`best starting point </Options/justlogic>` is another way to refer to same place but give your link text some title.
fr: Il existe de nombreuses options intéressantes pour commencer.

source: For details about the hardware and code options, see :ref:`Options section for hardware and code <hwcodeOptions>` .
fr: Pour plus de détails sur le matériel et les options de code
